<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"a830cc717f8a8de83b88d84e15c0694c1e60e3e5a19ce7bf4da8a97dd624d28b","plan_job_ref":"Job Validations on PR #13 at https://github.com/SelfOverflow/discord-bots/actions/runs/22018931487","plan_out_hash":"04a1617a6b3e84bd509b138c42808567c4770205379e3df99104ec20d8c625a9","plan_hash":"adea6ef0ec6dfb6a7f526d9e241f7f5ffb6e05297a6fbcaf32d59ca7939b342d","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "ap-south-1"
+       tags                                 = {
+           "Name" = "main"
        }
+       tags_all                             = {
+           "Name" = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #3](https://github.com/SelfOverflow/discord-bots/actions/runs/22018945157)